https://github.com/bincode423/class

In [1]:
import pandas as pd

In [ ]:
sd = pd.Series([1,2,3],index=['a','b','c'])
sd

a    1
b    2
c    3
dtype: int64

In [4]:
sd['a'] = 50
sd

a    50
b     2
c     3
dtype: int64

In [5]:
del sd['c']
sd

a    50
b     2
dtype: int64

In [9]:
sd.name = 'Series Name'
sd.index.name = 'Index Name'
sd

Index Name
a    50
b     2
Name: Series Name, dtype: int64

In [ ]:
import pandas as pd

subject = pd.Series([70.0,80.0,90.0],index=['국어','영어','수학'])
subject.name = '홍길동 중간고사 성적'
subject.index.name = '과목'

subject['국어'] = 70
subject['영어'] = 80
subject['수학'] = 90
subject['과학'] = 100
del subject['과학']
subject.astype('float64')
print(subject)

과목
국어    70.0
영어    80.0
수학    90.0
Name: 홍길동 중간고사 성적, dtype: float64

In [14]:
df = pd.DataFrame({'이름' : ['홍길동','이순신','강감찬'],
                   '나이' : [20,30,40],
                   '성별' : ['남', '남', '남']})
df.index = [1,2,3]
df

    이름  나이 성별
1  홍길동  20  남
2  이순신  30  남
3  강감찬  40  남

In [15]:
df = pd.read_csv('scores.csv')
df

        이름     국어   영어     수학
0     kate  100.0   90   95.0
1   olivia   90.0   80   75.0
2     emma   95.0  100  100.0
3   sophia  100.0  100  100.0
4      amy    NaN   35   60.0
5    james   70.0   75   65.0
6   daniel   80.0   90   55.0
7    peter   50.0   60    NaN
8    kevin  100.0  100   90.0
9     jack   90.0   95   70.0
10   james   70.0   75   65.0

In [16]:
df.nlargest(5, '국어')

       이름     국어   영어     수학
0    kate  100.0   90   95.0
3  sophia  100.0  100  100.0
8   kevin  100.0  100   90.0
2    emma   95.0  100  100.0
1  olivia   90.0   80   75.0

In [17]:
df.nsmallest(3,'수학')

       이름    국어  영어    수학
6  daniel  80.0  90  55.0
4     amy   NaN  35  60.0
5   james  70.0  75  65.0

In [18]:
df['국어']

0     100.0
1      90.0
2      95.0
3     100.0
4       NaN
5      70.0
6      80.0
7      50.0
8     100.0
9      90.0
10     70.0
Name: 국어, dtype: float64

In [19]:
df.iloc[7]

이름    peter
국어     50.0
영어       60
수학      NaN
Name: 7, dtype: object

In [20]:
df.iloc[4:8]

       이름    국어  영어    수학
4     amy   NaN  35  60.0
5   james  70.0  75  65.0
6  daniel  80.0  90  55.0
7   peter  50.0  60   NaN

In [22]:
df['국어'] == 100

0      True
1     False
2     False
3      True
4     False
5     False
6     False
7     False
8      True
9     False
10    False
Name: 국어, dtype: bool

In [23]:
df[df['국어']==100]

       이름     국어   영어     수학
0    kate  100.0   90   95.0
3  sophia  100.0  100  100.0
8   kevin  100.0  100   90.0

In [31]:
df[(df['국어'] > 60) & (df['국어'] < 90)]

        이름    국어  영어    수학
5    james  70.0  75  65.0
6   daniel  80.0  90  55.0
10   james  70.0  75  65.0

In [30]:
df[(df['국어'] >= 60) & (df['국어'] <= 90)]

        이름    국어  영어    수학
1   olivia  90.0  80  75.0
5    james  70.0  75  65.0
6   daniel  80.0  90  55.0
9     jack  90.0  95  70.0
10   james  70.0  75  65.0